[Killed] ConditionalExpression
busquedaBinaria.js:3:9
 function busquedaBinaria(arreglo, objetivo) {
 
-    if (!Array.isArray(arreglo)) {
+    if (true) {
         return -1;
     }
killedBy: Pruebas de búsqueda binaria Debe encontrar un elemento existente
statusReason: Expected -1 to be 2.

[Killed] BlockStatement
busquedaBinaria.js:3:34
 function busquedaBinaria(arreglo, objetivo) {
 
-    if (!Array.isArray(arreglo)) {
-        return -1;
-    }
+    if (!Array.isArray(arreglo)) {}
 
     if (arreglo.length === 0) {
killedBy: Pruebas de búsqueda binaria Debe retornar -1 si no recibe un arreglo válido
statusReason: TypeError: Cannot read properties of null (reading 'length')

[Killed] UnaryOperator
busquedaBinaria.js:4:16
 function busquedaBinaria(arreglo, objetivo) {
 
     if (!Array.isArray(arreglo)) {
-        return -1;
+        return +1;
     }
 
killedBy: Pruebas de búsqueda binaria Debe retornar -1 si no recibe un arreglo válido
statusReason: Expected 1 to be -1.

[Killed] EqualityOperator
busquedaBinaria.js:7:9
         return -1;
     }
 
-    if (arreglo.length === 0) {
+    if (arreglo.length !== 0) {
         return -1;
     }
killedBy: Pruebas de búsqueda binaria Debe encontrar un elemento existente
statusReason: Expected -1 to be 2.

[Killed] ConditionalExpression
busquedaBinaria.js:7:9
         return -1;
     }
 
-    if (arreglo.length === 0) {
+    if (true) {
         return -1;
     }
killedBy: Pruebas de búsqueda binaria Debe encontrar un elemento existente
statusReason: Expected -1 to be 2.

[Killed] UnaryOperator
busquedaBinaria.js:8:16
     }
 
     if (arreglo.length === 0) {
-        return -1;
+        return +1;
     }
 
killedBy: Pruebas de búsqueda binaria Debe retornar -1 en arreglo vacío
statusReason: Expected 1 to be -1.

[Survived] ArithmeticOperator
busquedaBinaria.js:12:19
     }
 
     let izquierda = 0;
-    let derecha = arreglo.length - 1;
+    let derecha = arreglo.length + 1;
 
     while (izquierda <= derecha) {

[Killed] EqualityOperator
busquedaBinaria.js:14:12
     let izquierda = 0;
     let derecha = arreglo.length - 1;
 
-    while (izquierda <= derecha) {
+    while (izquierda < derecha) {
 
         let medio = Math.floor((izquierda + derecha) / 2);
killedBy: Pruebas de búsqueda binaria Debe encontrar el último elemento
statusReason: Expected -1 to be 4.

[Killed] ConditionalExpression
busquedaBinaria.js:14:12
     let izquierda = 0;
     let derecha = arreglo.length - 1;
 
-    while (izquierda <= derecha) {
+    while (false) {
 
         let medio = Math.floor((izquierda + derecha) / 2);
killedBy: Pruebas de búsqueda binaria Debe encontrar un elemento existente
statusReason: Expected -1 to be 2.

[Killed] ArithmeticOperator
busquedaBinaria.js:16:33
 
     while (izquierda <= derecha) {
 
-        let medio = Math.floor((izquierda + derecha) / 2);
+        let medio = Math.floor((izquierda - derecha) / 2);
 
         if (arreglo[medio] === objetivo) {
killedBy: Pruebas de búsqueda binaria Debe encontrar un elemento existente
statusReason: Expected -1 to be 2.

[Timeout] ArithmeticOperator
busquedaBinaria.js:16:32
 
     while (izquierda <= derecha) {
 
-        let medio = Math.floor((izquierda + derecha) / 2);
+        let medio = Math.floor((izquierda + derecha) * 2);
 
         if (arreglo[medio] === objetivo) {

[Killed] ConditionalExpression
busquedaBinaria.js:18:13
 
         let medio = Math.floor((izquierda + derecha) / 2);
 
-        if (arreglo[medio] === objetivo) {
+        if (true) {
             return medio;
         }
killedBy: Pruebas de búsqueda binaria Debe retornar -1 si el elemento no existe
statusReason: Expected 2 to be -1.

[Killed] EqualityOperator
busquedaBinaria.js:18:13
 
         let medio = Math.floor((izquierda + derecha) / 2);
 
-        if (arreglo[medio] === objetivo) {
+        if (arreglo[medio] !== objetivo) {
             return medio;
         }
killedBy: Pruebas de búsqueda binaria Debe encontrar un elemento existente
statusReason: Expected 0 to be 2.

[Killed] ConditionalExpression
busquedaBinaria.js:22:13
             return medio;
         }
 
-        if (arreglo[medio] < objetivo) {
+        if (true) {
             izquierda = medio + 1;
         } else {
killedBy: Pruebas de búsqueda binaria Debe encontrar el primer elemento
statusReason: Expected -1 to be 0.

[Killed] EqualityOperator
busquedaBinaria.js:22:13
             return medio;
         }
 
-        if (arreglo[medio] < objetivo) {
+        if (arreglo[medio] >= objetivo) {
             izquierda = medio + 1;
         } else {
killedBy: Pruebas de búsqueda binaria Debe encontrar el primer elemento
statusReason: Expected -1 to be 0.

[Timeout] ArithmeticOperator
busquedaBinaria.js:23:25
         }
 
         if (arreglo[medio] < objetivo) {
-            izquierda = medio + 1;
+            izquierda = medio - 1;
         } else {
             derecha = medio - 1;

[Timeout] BlockStatement
busquedaBinaria.js:24:16
 
         if (arreglo[medio] < objetivo) {
             izquierda = medio + 1;
-        } else {
-            derecha = medio - 1;
-        }
+        } else {}
     }
 

[Timeout] ArithmeticOperator
busquedaBinaria.js:25:23
         if (arreglo[medio] < objetivo) {
             izquierda = medio + 1;
         } else {
-            derecha = medio - 1;
+            derecha = medio + 1;
         }
     }
